%% 由公历计算儒略日
function J0 = JulianDay(y,m,d)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数说明
% J0 - 世界时零时刻的儒略日
% y - 1901 至 2099 之间的年份
% m - 1 至 12 月
% d - 1 至 31 日
%
% References:
% Curtis, H. D. (2021). Orbital Mechanics for Engineering Students: Fourth Edition. Butterworth-Heinemann.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

J0 = 367 * y - fix(7 * (y + fix((m + 9)/12))/4) + fix(275 * m/9) + d + 1721013.5;
end

